* Data types

** Data frames

#+begin_src jupyter-R :session R :async yes
library(dslabs)
data(murders)
#+end_src

#+RESULTS:

#+begin_src jupyter-R :session R :async yes
class(murders)
#+end_src

** Examining an object

#+RESULTS:
#+begin_export markdown
'data.frame'
#+end_export

#+begin_src jupyter-R :session R :async yes
str(murders)
#+end_src

#+RESULTS:
: 'data.frame':	51 obs. of  5 variables:
:  $ state     : chr  "Alabama" "Alaska" "Arizona" "Arkansas" ...
:  $ abb       : chr  "AL" "AK" "AZ" "AR" ...
:  $ region    : Factor w/ 4 levels "Northeast","South",..: 2 4 4 2 4 4 1 2 2 2 ...
:  $ population: num  4779736 710231 6392017 2915918 37253956 ...
:  $ total     : num  135 19 232 93 1257 ...

#+begin_src jupyter-R :session R :async yes
head(murders)
#+end_src

#+RESULTS:
#+begin_export markdown

A data.frame: 6 x 5

| <!--/--> | state &lt;chr&gt; | abb &lt;chr&gt; | region &lt;fct&gt; | population &lt;dbl&gt; | total &lt;dbl&gt; |
|---|---|---|---|---|---|
| 1 | Alabama    | AL | South |  4779736 |  135 |
| 2 | Alaska     | AK | West  |   710231 |   19 |
| 3 | Arizona    | AZ | West  |  6392017 |  232 |
| 4 | Arkansas   | AR | South |  2915918 |   93 |
| 5 | California | CA | West  | 37253956 | 1257 |
| 6 | Colorado   | CO | West  |  5029196 |   65 |
#+end_export

** The accessor: =$=

#+begin_src jupyter-R :session R :async yes
murders$population
#+end_src

#+RESULTS:
#+begin_export markdown
1. 4779736
2. 710231
3. 6392017
4. 2915918
5. 37253956
6. 5029196
7. 3574097
8. 897934
9. 601723
10. 19687653
11. 9920000
12. 1360301
13. 1567582
14. 12830632
15. 6483802
16. 3046355
17. 2853118
18. 4339367
19. 4533372
20. 1328361
21. 5773552
22. 6547629
23. 9883640
24. 5303925
25. 2967297
26. 5988927
27. 989415
28. 1826341
29. 2700551
30. 1316470
31. 8791894
32. 2059179
33. 19378102
34. 9535483
35. 672591
36. 11536504
37. 3751351
38. 3831074
39. 12702379
40. 1052567
41. 4625364
42. 814180
43. 6346105
44. 25145561
45. 2763885
46. 625741
47. 8001024
48. 6724540
49. 1852994
50. 5686986
51. 563626
#+end_export

#+begin_src jupyter-R :session R :async yes
names(murders)
#+end_src

#+RESULTS:
#+begin_export markdown
1. 'state'
2. 'abb'
3. 'region'
4. 'population'
5. 'total'
#+end_export

*** Vectors: numerics, characters, and logical

#+begin_src jupyter-R :session R :async yes
pop <- murders$population
length(pop)
#+end_src

#+RESULTS:
#+begin_export markdown
51
#+end_export

#+begin_src jupyter-R :session R :async yes
class(pop)
#+end_src

#+RESULTS:
#+begin_export markdown
'numeric'
#+end_export

#+begin_src jupyter-R :session R :async yes
class(murders$state)
#+end_src

#+RESULTS:
#+begin_export markdown
'character'
#+end_export

#+begin_src jupyter-R :session R :async yes
z <- 3 == 2
z
#+end_src

#+RESULTS:
#+begin_export markdown
FALSE
#+end_export

#+begin_src jupyter-R :session R :async yes
class(z)
#+end_src

#+RESULTS:
#+begin_export markdown
'logical'
#+end_export

** Factors

#+begin_src jupyter-R :session R :async yes
class(murders$region)
#+end_src

#+RESULTS:
#+begin_export markdown
'factor'
#+end_export

#+begin_quote
It is a factor. Factors are useful for storing categorical data.
#+end_quote

#+begin_src jupyter-R :session R :async yes
levels(murders$region)
#+end_src

#+RESULTS:
#+begin_export markdown
1. 'Northeast'
2. 'South'
3. 'North Central'
4. 'West'
#+end_export

#+begin_src jupyter-R :session R :async yes
region <- murders$region
value <- murders$total
region <- reorder(region, value, FUN = sum)
levels(region)
#+end_src

#+RESULTS:
#+begin_export markdown
1. 'Northeast'
2. 'North Central'
3. 'West'
4. 'South'
#+end_export

** Lists

#+begin_src jupyter-R :session R :async yes
record <- list(name = "John Doe",
               student_id = 1234,
               grades = c(95, 82, 91, 97, 93),
               final_grade = "A")
#+end_src

#+RESULTS:

#+begin_src jupyter-R :session R :async yes
record
#+end_src

#+RESULTS:
#+begin_export markdown
$name
:   'John Doe'
$student_id
:   1234
$grades
:   1. 95
2. 82
3. 91
4. 97
5. 93



$final_grade
:   'A'
#+end_export

#+begin_src jupyter-R :session R :async yes
record$student_id
#+end_src

#+RESULTS:
#+begin_export markdown
1234
#+end_export

#+begin_src jupyter-R :session R :async yes
record[["student_id"]]
#+end_src

#+RESULTS:
#+begin_export markdown
1234
#+end_export

#+begin_src jupyter-R :session R :async yes
record2 <- list("John Doe", 1234)
record2
#+end_src

#+RESULTS:
#+begin_export markdown
1. 'John Doe'
2. 1234
#+end_export

#+begin_src jupyter-R :session R :async yes
record[[2]]
#+end_src

#+RESULTS:
#+begin_export markdown
1234
#+end_export

** Matrices

#+begin_src jupyter-R :session R :async yes
mat <- matrix(1:12, 4, 3)
mat
#+end_src

#+RESULTS:
#+begin_export markdown

A matrix: 4 x 3 of type int

| 1 | 5 |  9 |
| 2 | 6 | 10 |
| 3 | 7 | 11 |
| 4 | 8 | 12 |
#+end_export

#+begin_src jupyter-R :session R :async yes
mat[2, 3]
#+end_src

#+RESULTS:
#+begin_export markdown
10
#+end_export

#+begin_src jupyter-R :session R :async yes
mat[2,]
#+end_src

#+RESULTS:
#+begin_export markdown
1. 2
2. 6
3. 10
#+end_export

#+begin_src jupyter-R :session R :async yes
mat[, 3]
#+end_src

#+RESULTS:
#+begin_export markdown
1. 9
2. 10
3. 11
4. 12
#+end_export

#+begin_src jupyter-R :session R :async yes
mat[, 2:3]
#+end_src

#+RESULTS:
#+begin_export markdown

A matrix: 4 x 2 of type int

| 5 |  9 |
| 6 | 10 |
| 7 | 11 |
| 8 | 12 |
#+end_export

#+begin_src jupyter-R :session R :async yes
mat[1:2, 2:3]
#+end_src

#+RESULTS:
#+begin_export markdown

A matrix: 2 x 2 of type int

| 5 |  9 |
| 6 | 10 |
#+end_export

#+begin_src jupyter-R :session R :async yes
as.data.frame(mat)
#+end_src

#+RESULTS:
#+begin_export markdown

A data.frame: 4 x 3

| V1 &lt;int&gt; | V2 &lt;int&gt; | V3 &lt;int&gt; |
|---|---|---|
| 1 | 5 |  9 |
| 2 | 6 | 10 |
| 3 | 7 | 11 |
| 4 | 8 | 12 |
#+end_export

#+begin_src jupyter-R :session R :async yes
murders[25, 1]
#+end_src

#+RESULTS:
#+begin_export markdown
'Mississippi'
#+end_export

#+begin_src jupyter-R :session R :async yes
murders[2:3,]
#+end_src

#+RESULTS:
#+begin_export markdown

A data.frame: 2 x 5

| <!--/--> | state &lt;chr&gt; | abb &lt;chr&gt; | region &lt;fct&gt; | population &lt;dbl&gt; | total &lt;dbl&gt; |
|---|---|---|---|---|---|
| 2 | Alaska  | AK | West |  710231 |  19 |
| 3 | Arizona | AZ | West | 6392017 | 232 |
#+end_export
